package Entity;

public enum ResultCode {
	RC0000, // 대기
	RC1000, // 정상
	RC1001, // 정상C
	RC1100, // 수동
	RC1101, // 수동C
	RC2000, // 로그인실패
	RC2001, // 암호기간만료
	RC2002, // 업체번호미입력
	RC2003, // 업체번호불일치
	RC2004, // 2차비밀번호실패
	RC2005, // 계정확인
	RC2006, // 회원정보확인실패
	RC2007, // 거래처코드미입력
	RC2008, // OTP인증
	RC2010, // OM조회실패
	RC2100, // 인증필요
	RC2101, // 제3자동의필요
	RC2102, // 대표번호인증필요
	RC2103, // 휴대폰인증필요
	RC2104, // 확인서제출필요
	RC2105, // 자율점검
	RC2106, // 가입진행중
	RC2107, // 비밀번호재설정
	RC2108, // 2차인증필요
	RC2109, // 동의필요
	RC2200, // 비대상-개인
	RC2201, // 판매자가입필요
	RC2202, // 기본정보없음
	RC2203, // 매입미처리
	RC2204, // 일반매출없음
	RC2300, // 가입심사중
	RC2301, // 가입승인보류
	RC2302, // 가입거부
	RC2400, // 서비스이용정지
	RC2401, // 탈퇴보류
	RC2500, // IP차단
	RC3000, // 시간초과
	RC3001, // 시간초과1
	RC3002, // 답변대기
	RC9000, // 점검
	RC9001, // Not response
	RC9002, // No problem shutdown.
	RC9999, // Error
}
